'''LiangMingXuan的网站'''
import streamlit as st

page = st.sidebar.radio('我的首页',['我的兴趣推荐', '我的图片处理工具', '我的智慧词典', '我的留言区'])

def page1():
    '''我的兴趣推荐'''
    st.image('无标题.png')
    st.title('你好，这里是我的兴趣推荐')
    st.write('----------------------------------------------------------------------------------')
    st.markdown('**我最喜欢的电影是《熊出没逆转时空》和《长津湖之水门桥》**')
    st.write('前者是因为他是我的童年回忆，也奠定了我的理想，让我明白了什么是成功')
    st.write('后者引发了我对祖国的热爱，让我铭记了历史')
    st.image('规范化.png')
    st.write('----------------------------------------------------------------------------------')
    st.markdown('**我还喜欢看书**')
    st.write('《查理与巧克力工厂》《笑猫日记》《狂人日记》......')
    st.write('----------------------------------------------------------------------------------')
    st.markdown('**我爱玩的游戏**')
    st.write('《马里奥，塞尔达，我的世界......')
    st.write('----------------------------------------------------------------------------------')
    st.write('暂时先到这，敬请期待')
def page2():
    '''我的图片处理工具'''
    pass
def page3():
    '''我的智慧词典'''
    pass
def page4():
    '''我的留言区'''
    pass

if page == '我的兴趣推荐':
    page1()
elif page == '我的图片处理工具':
    page2()
elif page == '我的智慧词典':
    page3()
elif page == '我的留言区':
    page4()